Repository: CnCNet/dta-mg-client-launcher
Catalog: LocalizationResources/TextResource.*.resx
Languages: ar, ru, zh_hans, zh_hant

source: Exit
ar: خروج
ru: Выход
zh_hans: 退出
zh_hant: 退出

# ClientLauncher_WarningTitle
source: Client Launcher Warning
ar: تحذير مشغل الوسيط
ru: Предупреждение лаунчера клиента
zh_hans: 客户端启动器警告
zh_hant: 客戶端啟動器警告

source: Continue
ar: متابعة
ru: Продолжить
zh_hans: 继续
zh_hant: 繼續

# ClientLauncher_ErrorTitle
source: Client Launcher Error
ar: خطأ في مشغل الوسيط
ru: Ошибка лаунчера клиента
zh_hans: 客户端启动器错误
zh_hant: 客戶端啟動器錯誤

# DialogTest_Title
source: Client Launcher Dialog Test
ar: اختبار حوار مشغل الوسيط
ru: Тест диалогов лаунчера клиента
zh_hans: 客户端启动器对话框测试
zh_hant: 客戶端啟動器對話方塊測試

# DialogTest_Message
source: Click the buttons below to run dialog test.
ar: أنقر على الأزرار أدناه لتشغيل اختبار الحوار.
ru: Нажмите кнопки ниже для запуска теста диалогов.
zh_hans: 点击下方按钮运行对话框测试。
zh_hant: 點選下方按鈕執行對話方塊測試。

# Command_ShowIncompatibleGPU
source: Show incompatible GPU dialog
ar: أمر عرض الوحدة الرسومية للمعالج (GPU) غير متوافق
ru: Показать диалог о несовместимости GPU
zh_hans: 显示显卡不兼容对话框
zh_hant: 顯示顯示卡不相容對話方塊

# Button_OpenLink_AllButtonsWonTWork
source: Open link (All buttons here won't work)
ar: فتح الرابط (جميع الأزرار هنا لن تعمل)
ru: Открыть ссылку (все кнопки не будут работать)
zh_hans: 打开链接（此处所有按钮均无效）
zh_hant: 開啟連結（此處所有按鈕均無效）

# Button_LaunchXNA
source: Launch XNA version
ar: XNA تشغيل اصدار
ru: Запустить версию на XNA
zh_hans: 启动 XNA 版本
zh_hant: 啟動 XNA 版本

# Button_LaunchDX
source: Launch DirectX11 version
ar: DirectX11 تشغيل اصدار
ru: Запустить версию на DirectX11
zh_hans: 启动 DirectX11 版本
zh_hant: 啟動 DirectX11 版本

# Command_ShowMissingComponent
source: Show missing component dialog
ar: أمر عرض المكون المفقود
ru: Показать диалог об отсутствии компонента
zh_hans: 显示组件缺失对话框
zh_hant: 顯示元件缺失對話方塊

# Command_ShowMissingComponent_ComponentNamePlaceholder
source: Component name here
ar: عرض اسم المكون هنا
ru: Название компонента
zh_hans: 此处为组件名称
zh_hant: 此處為元件名稱

# Command_ThrowException
source: Throw an exception
ar: خطأ استثنائي
ru: Выдать ошибку
zh_hans: 抛出异常
zh_hant: 丟擲異常

# Command_ThrowException_Message
source: Exception message here
ar: رسالة الخطأ الاستثنائي
ru: Сообщение об ошибке
zh_hans: 此处为异常信息
zh_hant: 此處為異常資訊

# RemoveZoneIdentifer_ErrorMessage
source: An error occurred when the launcher tried to unblock files. Re-running the launcher with administrator privileges might help.
ar: لم يستطع البرنامج التعرف على الملفات. حاول التشغيل كمسؤول
ru: Произошла ошибка во время попытки лаунчера разблокировать файлы. Попробуйте перезапустить лаунчер с правами администратора.
zh_hans: 启动器尝试解除文件锁定时发生错误。以管理员权限重新运行启动器或许能解决问题。
zh_hant: 啟動器嘗試解除檔案鎖定時發生錯誤。以管理員許可權重新執行啟動器或許能解決問題。

# RemoveZoneIdentifer_FailedList
source: Failed to remove Zone.Identifier from the following files:
ar: فشل في إزالة Zone.Identifier من الملفات التالية:
ru: Не удалось удалить Zone.Identifier у следующих файлов:
zh_hans: 未能从以下文件移除 Zone.Identifier：
zh_hant: 未能從以下檔案移除 Zone.Identifier：

# IncompatibleGPU_Title
source: Graphics Card Incompatibility Detected
ar: كارت الشاشة غير متوافق
ru: Обнаружена несовместимость с видеокартой
zh_hans: 检测到显卡不兼容
zh_hant: 檢測到顯示卡不相容

# Button_OpenLink
source: Open link
ar: زر فتح الرابط
ru: Открыть ссылку
zh_hans: 打开链接
zh_hant: 開啟連結

# MainClientLibrary_NotFound
source: Main client library ({0}) not found!
ar: مكتبة الوسيط الرئيسية ({0}) غير موجودة!
ru: Библиотека основного клиента ({0}) не найдена!
zh_hans: 未找到主客户端库 ({0})！
zh_hant: 未找到主客戶端庫 ({0})！

# MainClientExecutable_NotFound
source: Main client executable ({0}) not found!
ar: الملف التنفيذي الوسيط الرئيسي ({0}) غير موجود!
ru: Исполняемый файл основного клиента ({0}) не найден!
zh_hans: 未找到主客户端可执行文件 ({0})！
zh_hant: 未找到主客戶端可執行檔案 ({0})！

# MissingComponent_Title
source: Component Missing
ar: مكون مفقود
ru: Отсутствует компонент
zh_hans: 组件缺失
zh_hant: 元件缺失

# UnsupportedOS_Title
source: Unsupported Operating System
ar: نظام تشغيل غير مدعوم
ru: Неподдерживаемая операционная система
zh_hans: 不支持的操作系统
zh_hant: 不支援的作業系統

# DialogTest_Message_Debug
source: Click the buttons below to run dialog test. Note: if you did not expect this, please make sure you have built the executable in Release configuration.
ar: أنقر على الأزرار أدناه لتشغيل اختبار الحوار. ملاحظة: إذا لم يكن هذا متوقعًا، فـتأكد من أنك قمت ببناء الملف التنفيذي (executable) في وضع الإصدار (Release).
ru: Нажмите кнопки ниже для запуска теста диалогов. Примечение: если вы не ожидали этого увидеть, убедитесь, что вы собрали клиент в конфигурации Release.
zh_hans: 点击下方按钮运行对话框测试。注意：若不希望看到此信息，请确保在 Release 配置下构建可执行文件。
zh_hant: 點選下方按鈕執行對話方塊測試。注意：若不希望看到此資訊，請確保在 Release 配置下構建可執行檔案。

# IncompatibleGPU_Message_Line1
source: The client has detected an incompatibility between your graphics card and both the DirectX11 and OpenGL versions of the CnCNet client.
ar: اكتشف الوسيط عدم توافق بين كارت الشاشة وكلا من OpenGL و DirectX11 لوسيط CnCNet
ru: Клиент обнаружил несовместимость между вашей видеокартой и версиями клиента CnCNet на DirectX11 и OpenGL.
zh_hans: 客户端检测到您的显卡与 CnCNet 客户端的 DirectX11 和 OpenGL 版本均不兼容。
zh_hant: 客戶端檢測到您的顯示卡與 CnCNet 客戶端的 DirectX11 和 OpenGL 版本均不相容。

# IncompatibleGPU_Message_Line2
source: The XNA version of the client could still work on your system, but it needs Microsoft XNA Framework 4.0 Refresh to be installed.
ar: إصدار XNA من الوسيط قد يعمل على نظامك، لكنه يحتاج إلى تثبيت Microsoft XNA Framework 4.0 Refresh أولاً.
ru: Версия клиента на XNA могла бы работать на вашей системе, но сначала нужно установить Microsoft XNA Framework 4.0 Refresh.
zh_hans: 客户端的 XNA 版本或许能在您的系统上运行，但需要安装 Microsoft XNA Framework 4.0 Refresh。
zh_hant: 客戶端的 XNA 版本或許能在您的系統上執行，但需要先安裝 Microsoft XNA Framework 4.0 Refresh。

# IncompatibleGPU_Message_Line3
source: You can download the installer from the following link:
ar: يمكنك تنزيل برنامج التثبيت من الرابط التالي:
ru: Установщик можно скачать по следующей ссылке:
zh_hans: 您可以从以下链接下载安装程序：
zh_hant: 您可以從以下連結下載安裝程式：

# IncompatibleGPU_Message_Line4
source: Alternatively, you can retry launching the DirectX11 version of the client.
ar: بدلاً من ذلك، يمكنك إعادة محاولة تشغيل إصدار DirectX11 من الوسيط.
ru: В качестве альтернативы можно еще раз попробовать запустить версию клиента на DirectX11.
zh_hans: 或者，您也可以重试启动客户端的 DirectX11 版本。
zh_hant: 或者，您也可以重試啟動客戶端的 DirectX11 版本。

# IncompatibleGPU_Message_Line5
source: We apologize for the inconvenience.
ar: نعتذر عن الإزعاج.
ru: Приносим извинения за неудобства.
zh_hans: 对于给您带来的不便，我们深表歉意。
zh_hant: 對於給您帶來的不便，我們深表歉意。

# SmartScreen_Blocked_Line1
source: Unable to launch the main client. It could be blocked by Windows SmartScreen.
ar: غير قادر على تشغيل الوسيط الرئيسي. قد يكون محظوراً بواسطة Windows SmartScreen.
ru: Не получается запустить основной клиент. Возможно, его заблокировал Windows SmartScreen.
zh_hans: 无法启动主客户端，可能是被 Windows SmartScreen 阻止了。
zh_hant: 無法啟動主客戶端，可能是被 Windows SmartScreen 阻止了。

# SmartScreen_Blocked_Line2
source: Please try to launch the following file manually:
ar: يرجى محاولة تشغيل الملف التالي يدوياً:
ru: Пожалуйста, попробуйте запустить данный файл вручную:
zh_hans: 请尝试手动启动以下文件：
zh_hant: 請嘗試手動啟動以下檔案：

# SmartScreen_Blocked_Line3
source: If the client still doesn't run, please contact the mod's authors for support.
ar: إذا لم يعمل الوسيط بعد، يرجى الاتصال بمطوري التعديل للحصول على الدعم.
ru: Если клиент все равно не запускается, свяжитесь с авторами мода и сообщите об ошибке.
zh_hans: 如果客户端仍无法运行，请联系 Mod 作者获取支持。
zh_hant: 如果客戶端仍無法執行，請聯絡 Mod 作者獲取支援。

# UnsupportedOS_Message_Line1
source: The client requires at least .NET Framework 4.8 to run, but it is not supported on your operating system.
ar: يتطلب الوسيط .NET Framework 4.8 على الأقل للتشغيل، لكنه غير مدعوم على نظام التشغيل الخاص بك.
ru: Для работы клиента требуется как минимум .NET Framework 4.8, но эта версия не поддерживается вашей ОС.
zh_hans: 客户端至少需要 .NET Framework 4.8 才能运行，但您的操作系统不支持。
zh_hant: 客戶端至少需要 .NET Framework 4.8 才能執行，但您的作業系統不支援。

# UnsupportedOS_Message_Line2
source: Please consider upgrading to a newer version of Windows.
ar: يرجى النظر في الترقية إلى إصدار أحدث من الويندوز.
ru: Если это возможно, перейдите на более новую версию Windows.
zh_hans: 请考虑升级到更新版本的 Windows。
zh_hant: 請考慮升級到更新版本的 Windows。

# MissingComponent_Message_Line1
source: The component {0} is missing.
ar: المكون المطلوب {0} مفقود.
ru: Отсутствует необходимый компонент {0}.
zh_hans: 组件 {0} 缺失。
zh_hant: 缺失必要的元件：{0}。

# MissingComponent_Message_Line2
source: You can download the installer from the following link:
ar: يمكنك تنزيل برنامج التثبيت من الرابط التالي:
ru: Вы можете скачать установщик по следующей ссылке:
zh_hans: 您可以从以下链接下载安装程序：
zh_hant: 您可以從以下連結下載安裝程式：
